; domain
(define (domain transport-strips)
(:requirements :typing :action-costs)

(:types location fuellevel locatable - object 
	package truck - locatable
)

(:predicates 
(connected ?l1 ?l2 - location)
(at ?o - locatable ?l - location)
(in ?p - package ?t - truck)
(fuel ?t - truck ?level - fuellevel)
(fuelcost ?level - fuellevel ?l1 ?l2 - location)
(sum ?a ?b ?c - fuellevel)
)

(:functions 
(total-cost) - number)

(:action LOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (at ?p ?l))
:effect
(and (not (at ?p ?l)) (in ?p ?t) (increase (total-cost) 1))
)

(:action UNLOAD
:parameters
(?p - package
?t - truck
?l - location)
:precondition
(and (at ?t ?l) (in ?p ?t))
:effect
(and (at ?p ?l) (not (in ?p ?t)) (increase (total-cost) 1))
)

(:action DRIVE
:parameters
(?t - truck
?l1 - location
?l2 - location
?fuelpost - fuellevel
?fueldelta - fuellevel
?fuelpre - fuellevel)
:precondition
(and 
(connected ?l1 ?l2)
(fuelcost ?fueldelta ?l1 ?l2)
(fuel ?t ?fuelpre)
(sum ?fuelpost ?fueldelta ?fuelpre)
(at ?t ?l1)
)
:effect
(and (not (at ?t ?l1)) 
     (at ?t ?l2) 
     (not (fuel ?t ?fuelpre)) 
     (fuel ?t ?fuelpost)
     (increase (total-cost) 1))
)

)

; problem
(define (problem transport-l3-t1-p5---int100n150-m25---int100c150---s26---e0)
(:domain transport-strips)

(:objects
l0 l1 l2 - location
t0 - truck
p0 p1 p2 p3 p4 - package
level0 level1 level2 level3 level4 level5 level6 level7 level8 level9 level10 level11 level12 level13 level14 level15 level16 level17 level18 level19 level20 level21 level22 level23 level24 level25 level26 level27 level28 level29 level30 level31 level32 level33 level34 level35 level36 level37 level38 level39 level40 level41 level42 level43 level44 level45 level46 level47 level48 level49 level50 level51 level52 level53 level54 level55 level56 level57 level58 level59 level60 level61 level62 level63 level64 level65 level66 level67 level68 level69 level70 level71 level72 level73 level74 level75 level76 level77 level78 level79 level80 level81 level82 level83 level84 level85 level86 level87 level88 level89 level90 level91 level92 level93 level94 level95 level96 level97 level98 level99 level100 level101 level102 level103 level104 level105 level106 level107 level108 level109 level110 level111 - fuellevel
)

(:init
(sum level0 level15 level15)
(sum level0 level22 level22)
(sum level0 level25 level25)
(sum level1 level15 level16)
(sum level1 level22 level23)
(sum level1 level25 level26)
(sum level2 level15 level17)
(sum level2 level22 level24)
(sum level2 level25 level27)
(sum level3 level15 level18)
(sum level3 level22 level25)
(sum level3 level25 level28)
(sum level4 level15 level19)
(sum level4 level22 level26)
(sum level4 level25 level29)
(sum level5 level15 level20)
(sum level5 level22 level27)
(sum level5 level25 level30)
(sum level6 level15 level21)
(sum level6 level22 level28)
(sum level6 level25 level31)
(sum level7 level15 level22)
(sum level7 level22 level29)
(sum level7 level25 level32)
(sum level8 level15 level23)
(sum level8 level22 level30)
(sum level8 level25 level33)
(sum level9 level15 level24)
(sum level9 level22 level31)
(sum level9 level25 level34)
(sum level10 level15 level25)
(sum level10 level22 level32)
(sum level10 level25 level35)
(sum level11 level15 level26)
(sum level11 level22 level33)
(sum level11 level25 level36)
(sum level12 level15 level27)
(sum level12 level22 level34)
(sum level12 level25 level37)
(sum level13 level15 level28)
(sum level13 level22 level35)
(sum level13 level25 level38)
(sum level14 level15 level29)
(sum level14 level22 level36)
(sum level14 level25 level39)
(sum level15 level15 level30)
(sum level15 level22 level37)
(sum level15 level25 level40)
(sum level16 level15 level31)
(sum level16 level22 level38)
(sum level16 level25 level41)
(sum level17 level15 level32)
(sum level17 level22 level39)
(sum level17 level25 level42)
(sum level18 level15 level33)
(sum level18 level22 level40)
(sum level18 level25 level43)
(sum level19 level15 level34)
(sum level19 level22 level41)
(sum level19 level25 level44)
(sum level20 level15 level35)
(sum level20 level22 level42)
(sum level20 level25 level45)
(sum level21 level15 level36)
(sum level21 level22 level43)
(sum level21 level25 level46)
(sum level22 level15 level37)
(sum level22 level22 level44)
(sum level22 level25 level47)
(sum level23 level15 level38)
(sum level23 level22 level45)
(sum level23 level25 level48)
(sum level24 level15 level39)
(sum level24 level22 level46)
(sum level24 level25 level49)
(sum level25 level15 level40)
(sum level25 level22 level47)
(sum level25 level25 level50)
(sum level26 level15 level41)
(sum level26 level22 level48)
(sum level26 level25 level51)
(sum level27 level15 level42)
(sum level27 level22 level49)
(sum level27 level25 level52)
(sum level28 level15 level43)
(sum level28 level22 level50)
(sum level28 level25 level53)
(sum level29 level15 level44)
(sum level29 level22 level51)
(sum level29 level25 level54)
(sum level30 level15 level45)
(sum level30 level22 level52)
(sum level30 level25 level55)
(sum level31 level15 level46)
(sum level31 level22 level53)
(sum level31 level25 level56)
(sum level32 level15 level47)
(sum level32 level22 level54)
(sum level32 level25 level57)
(sum level33 level15 level48)
(sum level33 level22 level55)
(sum level33 level25 level58)
(sum level34 level15 level49)
(sum level34 level22 level56)
(sum level34 level25 level59)
(sum level35 level15 level50)
(sum level35 level22 level57)
(sum level35 level25 level60)
(sum level36 level15 level51)
(sum level36 level22 level58)
(sum level36 level25 level61)
(sum level37 level15 level52)
(sum level37 level22 level59)
(sum level37 level25 level62)
(sum level38 level15 level53)
(sum level38 level22 level60)
(sum level38 level25 level63)
(sum level39 level15 level54)
(sum level39 level22 level61)
(sum level39 level25 level64)
(sum level40 level15 level55)
(sum level40 level22 level62)
(sum level40 level25 level65)
(sum level41 level15 level56)
(sum level41 level22 level63)
(sum level41 level25 level66)
(sum level42 level15 level57)
(sum level42 level22 level64)
(sum level42 level25 level67)
(sum level43 level15 level58)
(sum level43 level22 level65)
(sum level43 level25 level68)
(sum level44 level15 level59)
(sum level44 level22 level66)
(sum level44 level25 level69)
(sum level45 level15 level60)
(sum level45 level22 level67)
(sum level45 level25 level70)
(sum level46 level15 level61)
(sum level46 level22 level68)
(sum level46 level25 level71)
(sum level47 level15 level62)
(sum level47 level22 level69)
(sum level47 level25 level72)
(sum level48 level15 level63)
(sum level48 level22 level70)
(sum level48 level25 level73)
(sum level49 level15 level64)
(sum level49 level22 level71)
(sum level49 level25 level74)
(sum level50 level15 level65)
(sum level50 level22 level72)
(sum level50 level25 level75)
(sum level51 level15 level66)
(sum level51 level22 level73)
(sum level51 level25 level76)
(sum level52 level15 level67)
(sum level52 level22 level74)
(sum level52 level25 level77)
(sum level53 level15 level68)
(sum level53 level22 level75)
(sum level53 level25 level78)
(sum level54 level15 level69)
(sum level54 level22 level76)
(sum level54 level25 level79)
(sum level55 level15 level70)
(sum level55 level22 level77)
(sum level55 level25 level80)
(sum level56 level15 level71)
(sum level56 level22 level78)
(sum level56 level25 level81)
(sum level57 level15 level72)
(sum level57 level22 level79)
(sum level57 level25 level82)
(sum level58 level15 level73)
(sum level58 level22 level80)
(sum level58 level25 level83)
(sum level59 level15 level74)
(sum level59 level22 level81)
(sum level59 level25 level84)
(sum level60 level15 level75)
(sum level60 level22 level82)
(sum level60 level25 level85)
(sum level61 level15 level76)
(sum level61 level22 level83)
(sum level61 level25 level86)
(sum level62 level15 level77)
(sum level62 level22 level84)
(sum level62 level25 level87)
(sum level63 level15 level78)
(sum level63 level22 level85)
(sum level63 level25 level88)
(sum level64 level15 level79)
(sum level64 level22 level86)
(sum level64 level25 level89)
(sum level65 level15 level80)
(sum level65 level22 level87)
(sum level65 level25 level90)
(sum level66 level15 level81)
(sum level66 level22 level88)
(sum level66 level25 level91)
(sum level67 level15 level82)
(sum level67 level22 level89)
(sum level67 level25 level92)
(sum level68 level15 level83)
(sum level68 level22 level90)
(sum level68 level25 level93)
(sum level69 level15 level84)
(sum level69 level22 level91)
(sum level69 level25 level94)
(sum level70 level15 level85)
(sum level70 level22 level92)
(sum level70 level25 level95)
(sum level71 level15 level86)
(sum level71 level22 level93)
(sum level71 level25 level96)
(sum level72 level15 level87)
(sum level72 level22 level94)
(sum level72 level25 level97)
(sum level73 level15 level88)
(sum level73 level22 level95)
(sum level73 level25 level98)
(sum level74 level15 level89)
(sum level74 level22 level96)
(sum level74 level25 level99)
(sum level75 level15 level90)
(sum level75 level22 level97)
(sum level75 level25 level100)
(sum level76 level15 level91)
(sum level76 level22 level98)
(sum level76 level25 level101)
(sum level77 level15 level92)
(sum level77 level22 level99)
(sum level77 level25 level102)
(sum level78 level15 level93)
(sum level78 level22 level100)
(sum level78 level25 level103)
(sum level79 level15 level94)
(sum level79 level22 level101)
(sum level79 level25 level104)
(sum level80 level15 level95)
(sum level80 level22 level102)
(sum level80 level25 level105)
(sum level81 level15 level96)
(sum level81 level22 level103)
(sum level81 level25 level106)
(sum level82 level15 level97)
(sum level82 level22 level104)
(sum level82 level25 level107)
(sum level83 level15 level98)
(sum level83 level22 level105)
(sum level83 level25 level108)
(sum level84 level15 level99)
(sum level84 level22 level106)
(sum level84 level25 level109)
(sum level85 level15 level100)
(sum level85 level22 level107)
(sum level85 level25 level110)
(sum level86 level15 level101)
(sum level86 level22 level108)
(sum level86 level25 level111)
(sum level87 level15 level102)
(sum level87 level22 level109)
(sum level88 level15 level103)
(sum level88 level22 level110)
(sum level89 level15 level104)
(sum level89 level22 level111)
(sum level90 level15 level105)
(sum level91 level15 level106)
(sum level92 level15 level107)
(sum level93 level15 level108)
(sum level94 level15 level109)
(sum level95 level15 level110)
(sum level96 level15 level111)

(connected l0 l1)
(fuelcost level15 l0 l1)
(connected l0 l2)
(fuelcost level25 l0 l2)
(connected l1 l0)
(fuelcost level15 l1 l0)
(connected l1 l2)
(fuelcost level22 l1 l2)
(connected l2 l0)
(fuelcost level25 l2 l0)
(connected l2 l1)
(fuelcost level22 l2 l1)

(at t0 l2)
(fuel t0 level111)
(= (total-cost) 0)

(at p0 l2)
(at p1 l1)
(at p2 l1)
(at p3 l0)
(at p4 l2)
)

(:goal
(and
(at p0 l1)
(at p1 l0)
(at p2 l2)
(at p3 l1)
(at p4 l1)
)
)
(:metric minimize (total-cost)))

; plan
1. (load p4 t0 l2)
   deleted: (at p4 l2)
   added: (in p4 t0)
   goals met: 0 of 5
2. (load p0 t0 l2)
   deleted: (at p0 l2)
   added: (in p0 t0)
   goals met: 0 of 5
3. (drive t0 l2 l1 level89 level22 level111)
   deleted: (at t0 l2) (fuel t0 level111)
   added: (at t0 l1) (fuel t0 level89)
   goals met: 0 of 5
4. (load p2 t0 l1)
   deleted: (at p2 l1)
   added: (in p2 t0)
   goals met: 0 of 5
5. (load p1 t0 l1)
   deleted: (at p1 l1)
   added: (in p1 t0)
   goals met: 0 of 5
6. (drive t0 l1 l0 level74 level15 level89)
   deleted: (at t0 l1) (fuel t0 level89)
   added: (at t0 l0) (fuel t0 level74)
   goals met: 0 of 5
7. (unload p1 t0 l0)
   deleted: (in p1 t0)
   added: (at p1 l0)
   goals met: 1 of 5
8. (load p3 t0 l0)
   deleted: (at p3 l0)
   added: (in p3 t0)
   goals met: 1 of 5
9. (drive t0 l0 l1 level59 level15 level74)
   deleted: (at t0 l0) (fuel t0 level74)
   added: (at t0 l1) (fuel t0 level59)
   goals met: 1 of 5
10. (unload p0 t0 l1)
   deleted: (in p0 t0)
   added: (at p0 l1)
   goals met: 2 of 5
11. (unload p3 t0 l1)
   deleted: (in p3 t0)
   added: (at p3 l1)
   goals met: 3 of 5
12. (unload p4 t0 l1)
   deleted: (in p4 t0)
   added: (at p4 l1)
   goals met: 4 of 5
13. (drive t0 l1 l2 level37 level22 level59)
   deleted: (at t0 l1) (fuel t0 level59)
   added: (at t0 l2) (fuel t0 level37)
   goals met: 4 of 5
14. (unload p2 t0 l2)
   deleted: (in p2 t0)
   added: (at p2 l2)
   goals met: 5 of 5
